i = [1, 2, 3, 4, 5]
j = i
print("i= ", i) # i=  [1, 2, 3, 4, 5]
print('j= ', j) # j=  [1, 2, 3, 4, 5]

# 参照なのでiも変わる
j[0] = 100
print("i= ", i) # i=  [100, 2, 3, 4, 5]
print('j= ', j) # j=  [100, 2, 3, 4, 5]

#これを避ける方法
x = [1, 2, 3 ,4 ,5]
# y = x.copy()
#上記のコピーメソッドでコピーするか以下、copyメソッドの方が明示的でわかりやすい
y = x[:]
y[0] = 100
print('x ', x ) # x  [1, 2, 3, 4, 5]
print('y ', y) # y  [100, 2, 3, 4, 5]

X = 20
Y = X
Y = 5
print(id(X)) # 4307345776
print(id(Y)) # 4307345296
print(X) # 20
print(Y) # 5

X = ["a", "b"]
Y = X
print(id(X)) # 4349542208
print(id(Y)) # 4349542208