l = [1, 2, 3, 50, 100, 4, 7, 8, 9, 22]
print(l) # [1, 2, 3, 50, 100, 4, 7, 8, 9, 22]
print(l[1]) # 2
print(l[-1]) # 22
print(l[-2]) # 9
print(l[0:2]) # [1, 2]
print(l[:2]) # [1, 2]
print(l[2:5]) # [3, 50, 100]
print(l[2:]) # [3, 50, 100, 4, 7, 8, 9, 22]
print(l[:]) # [1, 2, 3, 50, 100, 4, 7, 8, 9, 22]
print(len(l)) # 10
print(type(l)) # <class 'list'>
ary = list('abcdefg')
print(ary) # ['a', 'b', 'c', 'd', 'e', 'f', 'g']

n = [1 ,2 ,3 ,4 ,5, 6, 7, 8, 9, 10]
print(n) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# n の中身を二つ飛ばしで出力させたい場合
print(n[::2]) # [1, 3, 5, 7, 9]
# 最後から出力
print(n[::-1]) # [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

#　ネストされたリスト
texts = ['a', 'b', 'c']
nums = [1 ,2, 3]
x = [texts, nums]
print(x) # [['a', 'b', 'c'], [1, 2, 3]]
