# リストの操作
s = list('abcdefg')
print(s[0]) # a
print(s) # ['a', 'b', 'c', 'd', 'e', 'f', 'g']

s[0] = 'X'
print(s) # ['X', 'b', 'c', 'd', 'e', 'f', 'g']

print(s[2:5]) # ['c', 'd', 'e']
s[2:5] = list('あああ')
print(s) # ['X', 'b', 'あ', 'あ', 'あ', 'f', 'g']
s[2:5] = []
print(s) # ['X', 'b', 'f', 'g']
s[:] = []
print(s) # []

n = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(n) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
n.append(100)
print(n) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
n.insert(0, 200)
print(n) # [200, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
print(n.pop()) # 100
print(n) # [200, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(n.pop(0)) # 200
print(n) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
del n[0]
print(n) # [2, 3, 4, 5, 6, 7, 8, 9, 10]
del n
# print(n) delで　n 自体が削除されているためエラーになる
n = [1 ,2 ,2, 2, 3]
n.remove(2)
print(n) # [1, 2, 2, 3] 最初の2が消える
n.remove(2)
n.remove(2)
print(n) # [1, 3]
# n.remove(2) 2がないので、エラーになる

a = [1, 2, 3, 4, 5]
b = [6, 7, 8, 9, 10]
x = a + b
print(x) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
a += b
print(a) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

x = [1, 2, 3, 4, 5]
y = [6, 7, 8, 9, 10]
x.extend(y)
print(x) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]


